{
  "intro": {
    "title": "Build Your Future with DAL-sh",
    "description": "Join a team of passionate innovators who are shaping the future of technology. At DAL-sh, we believe that great people build great software. We offer a dynamic work environment where creativity thrives, skills are developed, and achievements are celebrated. Whether you're a seasoned professional or just starting your career, we provide the opportunities and support you need to excel."
  },
  "benefits": [
    {
      "title": "Competitive Compensation",
      "description": "Industry-leading salaries with performance bonuses and equity options for key contributors",
      "icon": "💰"
    },
    {
      "title": "Health & Wellness",
      "description": "Comprehensive health insurance, dental, vision, and mental health support programs",
      "icon": "🏥"
    },
    {
      "title": "Flexible Work",
      "description": "Remote work options and flexible hours to maintain work-life balance",
      "icon": "🏠"
    },
    {
      "title": "Learning & Development",
      "description": "Continuous training, conference attendance, and certification support",
      "icon": "📚"
    },
    {
      "title": "Modern Technology",
      "description": "Work with cutting-edge tools, latest frameworks, and innovative tech stack",
      "icon": "💻"
    },
    {
      "title": "Career Growth",
      "description": "Clear advancement paths with mentorship programs and leadership opportunities",
      "icon": "📈"
    },
    {
      "title": "Team Events",
      "description": "Regular team building activities, hackathons, and social gatherings",
      "icon": "🎉"
    },
    {
      "title": "Paid Time Off",
      "description": "Generous vacation policy, sick leave, and paid parental leave",
      "icon": "🌴"
    },
    {
      "title": "Strategic Partnership",
      "description": "Collaborate with us on joint ventures and co-development to drive mutual growth and market expansion",
      "icon": "🤝"
    }
  ],
  "positions": [
    {
      "title": "Senior Full-Stack Developer",
      "location": "Penang, MY / Remote",
      "type": "Full-Time",
      "experience": "5+ years",
      "description": "We're seeking an experienced full-stack developer to join our core development team. You'll work on challenging projects using modern technologies and contribute to architectural decisions.",
      "requirements": [
        "5+ years of experience with React, Node.js, and modern JavaScript",
        "Strong understanding of microservices architecture and RESTful APIs",
        "Experience with cloud platforms (AWS, Azure, or GCP)",
        "Proficiency in database design (SQL and NoSQL)",
        "Excellent problem-solving and communication skills",
        "Bachelor's degree in Computer Science or equivalent experience"
      ]
    },
    {
      "title": "UX/UI Designer",
      "location": "Melaka, MY / Hybrid",
      "type": "Full-Time",
      "experience": "3+ years",
      "description": "Join our design team to create beautiful, intuitive user experiences. You'll collaborate with developers and stakeholders to design products that users love.",
      "requirements": [
        "3+ years of experience in UX/UI design for web and mobile applications",
        "Proficiency in Figma, Adobe XD, or similar design tools",
        "Strong portfolio demonstrating user-centered design approach",
        "Experience with design systems and component libraries",
        "Understanding of HTML/CSS and responsive design principles",
        "Excellent visual design and prototyping skills"
      ]
    },
    {
      "title": "DevOps Engineer",
      "location": "Kuala Lumpur, MY / Remote",
      "type": "Full-Time",
      "experience": "4+ years",
      "description": "Help us build and maintain robust CI/CD pipelines and cloud infrastructure. You'll ensure our systems are scalable, secure, and highly available.",
      "requirements": [
        "4+ years of experience in DevOps or Site Reliability Engineering",
        "Strong knowledge of Kubernetes, Docker, and container orchestration",
        "Experience with CI/CD tools (Jenkins, GitLab CI, GitHub Actions)",
        "Proficiency in infrastructure as code (Terraform, CloudFormation)",
        "Scripting skills in Python, Bash, or similar languages",
        "Experience with monitoring tools (Prometheus, Grafana, ELK stack)"
      ]
    },
    {
      "title": "Mobile Developer (iOS/Android)",
      "location": "Seremban, MY / Hybrid",
      "type": "Full-Time",
      "experience": "3+ years",
      "description": "Build next-generation mobile applications for iOS and Android platforms. Work with cross-functional teams to deliver exceptional mobile experiences.",
      "requirements": [
        "3+ years of mobile development experience (Swift/Kotlin or Flutter/React Native)",
        "Strong understanding of mobile UI/UX best practices",
        "Experience with RESTful APIs and mobile app architecture patterns",
        "Knowledge of mobile app deployment and App Store/Play Store processes",
        "Familiarity with mobile testing frameworks and CI/CD for mobile",
        "Portfolio of published mobile applications"
      ]
    },
    {
      "title": "QA Automation Engineer",
      "location": "Perak, MY / Remote",
      "type": "Full-Time",
      "experience": "3+ years",
      "description": "Lead our quality assurance efforts by developing automated testing frameworks and ensuring software quality across all our products.",
      "requirements": [
        "3+ years of experience in QA automation and testing",
        "Proficiency in test automation tools (Selenium, Cypress, Jest, Pytest)",
        "Experience with API testing and performance testing",
        "Strong programming skills in JavaScript, Python, or Java",
        "Knowledge of CI/CD integration for automated testing",
        "ISTQB certification or equivalent is a plus"
      ]
    },
    {
      "title": "Product Manager",
      "location": "Penang, MY / Hybrid",
      "type": "Full-Time",
      "experience": "5+ years",
      "description": "Drive product strategy and execution for our software solutions. Work with engineering, design, and business teams to deliver products that delight customers.",
      "requirements": [
        "5+ years of product management experience in software companies",
        "Strong understanding of agile methodologies and product development lifecycle",
        "Excellent analytical and data-driven decision-making skills",
        "Experience with user research and customer feedback analysis",
        "Strong communication and stakeholder management abilities",
        "Technical background or MBA preferred"
      ]
    }
  ]
}